#+TITLE: Desktop
#+STARTUP: fold
- M-x org-babel-tangle
* List all installed packages
  #+BEGIN_SRC sh
    pacman -Qqe
  #+END_SRC

  #+RESULTS:
  | acpi                         |
  | alacritty                    |
  | alsa-utils                   |
  | autoconf                     |
  | automake                     |
  | awesome-terminal-fonts       |
  | base                         |
  | binutils                     |
  | bison                        |
  | blueman                      |
  | bluez                        |
  | bluez-utils                  |
  | blugon                       |
  | bspwm                        |
  | bunsen-themes-git            |
  | chromium                     |
  | cmake                        |
  | composer                     |
  | dhcpcd                       |
  | dialog                       |
  | discord                      |
  | dmenu                        |
  | docker                       |
  | docker-compose               |
  | dosfstools                   |
  | dunst                        |
  | efibootmgr                   |
  | fakeroot                     |
  | fd                           |
  | file                         |
  | file-roller                  |
  | filezilla                    |
  | findutils                    |
  | firefox                      |
  | flex                         |
  | gawk                         |
  | gcc                          |
  | gettext                      |
  | git                          |
  | gnome-keyring                |
  | gnome-screenshot             |
  | google-chrome-dev            |
  | gpm                          |
  | gptfdisk                     |
  | graphviz                     |
  | grep                         |
  | groff                        |
  | gzip                         |
  | lazygit                      |
  | libgccjit                    |
  | libreoffice-fresh            |
  | libtool                      |
  | light                        |
  | lightdm                      |
  | lightdm-gtk-greeter          |
  | lightdm-gtk-greeter-settings |
  | linux                        |
  | linux-firmware               |
  | linux-headers                |
  | m4                           |
  | make                         |
  | man-db                       |
  | masterpdfeditor              |
  | mpv                          |
  | msmtp                        |
  | nano                         |
  | ncdu                         |
  | neofetch                     |
  | neovim-git                   |
  | nerd-fonts-hack              |
  | netctl                       |
  | nextcloud-client             |
  | nitrogen                     |
  | nodejs-intelephense          |
  | nodejs-less                  |
  | nodejs-less-plugin-clean-css |
  | npm                          |
  | nvidia                       |
  | pacman                       |
  | pacman-contrib               |
  | patch                        |
  | php-gd                       |
  | phpstorm                     |
  | phpstorm-jre                 |
  | picom                        |
  | pkgconf                      |
  | polybar                      |
  | pulseaudio-bluetooth         |
  | python                       |
  | python-adblock               |
  | python-pynvim                |
  | qutebrowser-git              |
  | redshift                     |
  | redshiftgui-bin              |
  | reflector                    |
  | ripgrep                      |
  | ruby-fusuma                  |
  | sed                          |
  | sendemail                    |
  | skypeforlinux-stable-bin     |
  | spotify                      |
  | sudo                         |
  | sxhkd                        |
  | teams                        |
  | teamviewer                   |
  | texinfo                      |
  | texlive-bibtexextra          |
  | texlive-core                 |
  | texlive-fontsextra           |
  | texlive-formatsextra         |
  | texlive-games                |
  | texlive-humanities           |
  | texlive-latexextra           |
  | texlive-music                |
  | texlive-pictures             |
  | texlive-pstricks             |
  | texlive-publishers           |
  | texlive-science              |
  | the_silver_searcher          |
  | thunar                       |
  | thunar-archive-plugin        |
  | tree-sitter                  |
  | ttf-hack                     |
  | ttf-ms-fonts                 |
  | tutanota-desktop-bin         |
  | unzip                        |
  | vim                          |
  | visual-studio-code-bin       |
  | which                        |
  | wmname                       |
  | wpa_supplicant               |
  | xclip                        |
  | xorg-xinput                  |
  | yarn                         |
  | yay                          |
  | youtube-dl                   |
  | yuicompressor                |
  | zip                          |
  | zoom                         |
  | zsh                          |
